copyright=\
(c) Copyright 2022, Yatta Solutions GmbH. Alle Rechte vorbehalten.\n\
Visit http://uml-lab.com

licenseUrl=http://www.yatta.de/fileadmin/rechtliches/Deutsch/UML_Lab_Allgemeine_Lizenzbestimmungen_mit_Anlagen.pdf

license=\
UML Lab\n\
Allgemeine Lizenz- und Nutzungsbestimmungen\n\
\n\
Hinweis\n\
\n\
Durch Herunterladen, Installieren oder Kopieren der Software, die Zustimmung zur Vereinbarung (per Mausklick oder auf sonstige Weise), den Zugriff auf die Software oder eine anderweitige Nutzung der Software erkl\u00e4rt sich der Lizenznehmer mit den Bedingungen dieser Vereinbarung und den erg\u00e4nzenden Bestimmungen (z.B. Webshop AGB) der Yatta Solutions GmbH einverstanden. Wenn Sie diese Bestimmungen im Namen des Lizenznehmers akzeptieren, gew\u00e4hrleisten und best\u00e4tigen Sie damit, dass Sie berechtigt sind, den Lizenznehmer zur Einhaltung dieser Bestimmungen zu verpflichten.\n\
\n\
Wenn Sie mit diesen Bestimmungen nicht einverstanden sind,\n\
* d\u00fcrfen Sie das Programm nicht herunterladen, installieren, kopieren, die Vereinbarung (per Mausklick oder auf sonstige Weise) akzeptieren, auf das Programm zugreifen oder das Programm nutzen und\n\
* m\u00fcssen Sie die Datentr\u00e4ger, die Benutzerdokumentation und etwaige Berechtigungsnachweise unbenutzt und unverz\u00fcglich bei der Stelle, von der Sie die Software bezogen haben, gegen R\u00fcckerstattung etwaig gezahlter Betr\u00e4ge zur\u00fcckgeben. Wurde die Software heruntergeladen, m\u00fcssen alle Kopien der Software vernichtet werden.\n\
\n\
\n\
\n\
Einleitung\n\
Die Yatta Solutions GmbH mit Sitz in Kassel, Deutschland, (Yatta Solutions) entwickelt und vertreibt Softwareprodukte selbst und \u00fcber Dritte. Mit UML Lab bietet die Yatta Solutions eine Anwendungsentwicklungssoftware in verschiedenen Editionen an.\n\
Der Lizenznehmer erwirbt Nutzungsrechte f\u00fcr den eigenen, unternehmensinternen und zeitlich befristeten Einsatz - nicht jedoch f\u00fcr die Weiterverbreitung oder Weiterver\u00e4u\u00dferung oder sonstige Zwecke - der vertragsgegenst\u00e4ndlichen Software f\u00fcr die Lizenzdauer (\u00fcblicherweise 1 Jahr) in der gew\u00e4hlten Edition gem\u00e4\u00df den nachfolgenden Bestimmungen.\n\
\n\
\n\
\n\
1. Definitionen\n\
1.1  Download ist die Bereitstellung eines Links zum Herunterladen von Software oder Softwarebestandteilen \u00fcber das Internet.\n\
\n\
1.2  Lizenzdauer ist die Laufzeit der Lizenz gem\u00e4\u00df Lizenzschein zuz\u00fcglich eventueller Verl\u00e4ngerungen der Laufzeit, jedoch beschr\u00e4nkt auf die Dauer dieses Software-Mietvertrages.\n\
\n\
1.3  Lizenzpreise sind das vom Lizenznehmer zu entrichtende Entgelt f\u00fcr die Nutzung der Software (Gebrauchsgew\u00e4hrung) gem\u00e4\u00df dieser Lizenzvereinbarung.\n\
\n\
1.4  Der Lizenznehmer ist der Kunde der Yatta Solutions und entweder Verbraucher oder Unternehmer im Sinne der \u00a7\u00a7 13, 14 BGB.\n\
\n\
1.5  Lizenzschein ist das Dokument, welches Art (Software, Edition) und Umfang (Anzahl und Art vergebener Lizenzschl\u00fcssel) der erlaubten Nutzung der Software nach Ma\u00dfgabe dieser Lizenzbestimmungen konkretisiert. Der Lizenzschein wird in digitaler Form \u00fcbermittelt. Sofern nicht anders angegeben, dient die Rechnung als Nachweis \u00fcber den ausgestellten Lizenzschein.\n\
\n\
1.6  Patches sind Programme oder Programmbestandteile zur Fehlerbehebung von Software.\n\
\n\
1.7  Release ist die Lieferung, Bereitstellung per Download oder sonstige Ver\u00f6ffentlichung einer neuen Version der Software. Wesentliche Funktionserweiterungen erfolgen durch ein Major Release; kleinere Funktionserweiterungen, Verbesserungen oder Fehlerbeseitigungen erfolgen durch ein Minor Release oder einen Patch.\n\
\n\
1.8  Die Schriftform bestimmt sich nach \u00a7\u00a7 126, 126a BGB.\n\
\n\
1.9  Software ist, sofern nicht anders angegeben, das im Lizenzschein bezeichnete Computerprogramm UML Lab gem\u00e4\u00df beiliegender Funktionsbeschreibung - in der angegebenen Edition in kompilierter Form inklusive der zugeh\u00f6rigen Benutzerdokumentation in Deutsch oder Englisch und den zugeh\u00f6rigen Updates.\n\
\n\
1.10  Technischer Support ist die unentgeltliche Erbringung von Beratungsleistungen zum Zwecke des Kundenservices nach Ma\u00dfgabe der jeweils aktuellen Support Richtlinie.\n\
\n\
1.11  Textform ist jede Erkl\u00e4rung nach \u00a7 126b BGB, darunter auch Emails, Briefe, Telefax, etc.\n\
\n\
1.12  Templates sind Textvorlagen, welche von der Software zur Codegenerierung und zum Reverse Engineering verwendet werden.\n\
\n\
1.13  Unterst\u00fctzungssoftware sind Computerprogramme bzw. Teile hiervon von Drittherstellern, die gemeinsam mit der Software der Yatta Solutions ausgeliefert werden.\n\
\n\
1.14  Updates sind Aktualisierungen der Software zur Fehlerbeseitigung oder Verbesserung.\n\
\n\
1.15  Work Around ist die Umgehung oder \u00dcberbr\u00fcckung eines Softwarefehlers ohne Eingriff in den Quellcode oder ausf\u00fchrbaren Code durch ein Upgrade oder Update.\n\
\n\
\n\
\n\
2. Vertragsgegenstand\n\
2.1  Vertragsgegenstand\n\
Gegenstand dieses Vertrags ist die auf die Lizenz- und Vertragsdauer befristete \u00dcberlassung der Software in der gew\u00e4hlten Edition nebst Einr\u00e4umung der zu deren vertragsgem\u00e4\u00dfer Nutzung erforderlichen Rechte nach Ma\u00dfgabe der Ziffer 3.\n\
\n\
2.2  Vereinbarte Beschaffenheit\n\
2.2.1  Die Beschaffenheit und Funktionalit\u00e4t der Software ergibt sich abschlie\u00dfend aus dem Lizenzschein und der beigef\u00fcgten Funktionsbeschreibung. Die darin enthaltenen Angaben sind als Leistungsbeschreibungen zu verstehen und nicht als Garantien. Eine Garantie wird nur gew\u00e4hrt, wenn sie als solche ausdr\u00fccklich bezeichnet worden ist.\n\
2.2.2  Die auf der Website der Yatta Solutions befindlichen oder auf andere Weise zur Verf\u00fcgung gestellten Produktspezifikationen, Illustrationen, Zeichnungen, Detailangaben, Leistungsdaten und andere Daten und Informationen sind nicht Gegenstand einer Garantie oder sonstigen Form einer Zusicherung von Eigenschaften.\n\
\n\
2.3  Sonstige Leistungen\n\
2.3.1  Sonstige Leistungen - insbesondere bestimmte Funktionserweiterungen, Anpassungsma\u00dfnahmen an spezielle, in der aktuellen Version nicht unterst\u00fctzte Systeme (Hardware oder Software), Installation, Wartung, Konfiguration und Schulung oder sonstige Beratungsleistungen sind nicht Gegenstand dieses Vertrags und daher grunds\u00e4tzlich nicht durch die Yatta Solutions geschuldet.\n\
2.3.2  Solche Leistungen k\u00f6nnen aber zwischen den Parteien gesondert vereinbart werden.\n\
\n\
\n\
\n\
3. Rechteeinr\u00e4umung\n\
3.1  Lizenzrechte und -anzahl\n\
3.1.1  Der Lizenznehmer erh\u00e4lt das nicht-ausschlie\u00dfliche, zeitlich auf die Laufzeit der Lizenz und des Software-Mietvertrags beschr\u00e4nkte, nicht \u00fcbertragbare und nicht unterlizensierbare, weltweite Recht zur Benutzung der Software im Rahmen der nachstehenden Bestimmungen.\n\
3.1.2  Die Art der gestatteten Benutzung (insbesondere die Art der Hardware, auf der die Software benutzt werden darf), der Umfang der gestatteten Benutzung (insbesondere die Anzahl der lizenzierten Ger\u00e4te sowie die Anzahl der Nutzer bzw. im Fall von Floating Licenses die Anzahl der Nutzer, die zeitgleich die Software benutzen d\u00fcrfen) und die Anzahl der ausgestellten Lizenzen (Anzahl vergebener Lizenzschl\u00fcssel) richten sich nach den weiteren Vereinbarungen der Parteien wie sie im Lizenzschein niedergelegt sind, insbesondere danach, \u00fcber welche Edition und wie viele Lizenzen der Software der Vertrag zustande gekommen ist. Die einzelnen Editionen der Software mit den jeweils mit diesen verbundenen Rechten werden in der Anlage Lizenzarten beschrieben.\n\
\n\
3.2  Benutzung der Templates\n\
3.2.1  Der Lizenznehmer erh\u00e4lt au\u00dferdem das Recht, die in der Software enthaltenen Templates f\u00fcr eigene Entwicklungszwecke zu \u00e4ndern und in ge\u00e4nderter Form zu benutzen oder mit Hilfe der Software neue Templates zu erstellen, diese wiederum zu \u00e4ndern und in ge\u00e4nderter Form zu benutzen. Der Umfang der Gestattung dieser Benutzung entspricht dem, der f\u00fcr die unver\u00e4nderte Software gem\u00e4\u00df Ziffer 3.1 gilt.\n\
3.2.2  Bei der Benutzung der Software, einschlie\u00dflich der Templates, zur Entwicklung von Computerprogrammen durch den Lizenznehmer k\u00f6nnen unter Umst\u00e4nden auch einzelne kleine Teile der Templates  in die entwickelten Computerprogramme \u00fcbernommen werden. Der Lizenznehmer erh\u00e4lt das nicht-ausschlie\u00dfliche, unbefristete, weltweite Recht, diese Teile in ver\u00e4nderter oder unver\u00e4nderter Form zu vervielf\u00e4ltigen, zu verbreiten und \u00f6ffentlich zug\u00e4nglich zu machen, soweit diese Teile Bestandteil dieser Computerprogramme und f\u00fcr deren Ablauf erforderlich sind.\n\
3.2.3  Zur Klarstellung wird angemerkt, dass die blo\u00dfe bestimmungsgem\u00e4\u00dfe Benutzung der Software durch den Lizenznehmer nicht dazu f\u00fchrt, dass die Yatta Solutions Rechte des Lizenznehmers an der vom Lizenznehmer mit Hilfe der Software entwickelten Computerprogrammen oder Teilen von solchen Computerprogrammen erwirbt.\n\
3.2.4  Die Einr\u00e4umung der Rechte gem\u00e4\u00df vorstehender Abs\u00e4tze steht, soweit es sich nicht um eine unentgeltliche Edition der Software handelt, unter der aufschiebenden Bedingung der vollst\u00e4ndigen Zahlung der nach Ziffer 4 geschuldeten Lizenzgeb\u00fchren.\n\
\n\
3.3  Fehlerkorrektur und Dekompilierung\n\
3.3.1  Dar\u00fcber hinaus ist der Lizenznehmer zur Vervielf\u00e4ltigung, Bearbeitung, Dekompilierung und sonstigem Reengineering der Entwicklungsstufen der Software nur gem\u00e4\u00df folgenden Regelungen befugt.\n\
3.3.2  Eine Vervielf\u00e4ltigung und Bearbeitung ist gestattet, wenn und soweit es der Beseitigung eines Mangels der Software dient und Yatta Solutions mit der Beseitigung des Mangels in Verzug ist. Bedient sich der Lizenznehmer daf\u00fcr eines gewerblich t\u00e4tigen Dritten, darf diese nicht mit Yatta Solutions in einem potentiellen Wettbewerbsverh\u00e4ltnis stehen, wenn die Vornahme der Mangelbeseitigung bef\u00fcrchten l\u00e4sst, dass wesentliche Programmfunktionen und -arbeitsweisen offengelegt werden.\n\
3.3.3  Die Dekompilierung des \u00fcberlassenen Codes ist gestattet, soweit sie dazu dient, die zur Herstellung der Interoperabilit\u00e4t eines unabh\u00e4ngig geschaffenen Computerprogramms notwendigen Informationen zu erlangen, wenn diese Informationen nicht ohne weiteres anderweitig beschafft werden k\u00f6nnen. Die Dekompilierung ist nur zul\u00e4ssig, wenn der Lizenznehmer zuvor bei Yatta Solutions die ben\u00f6tigten Informationen gegen Begleichung einer Aufwandsentsch\u00e4digung angefordert hat und Yatta Solutions dem nicht innerhalb angemessener Zeit nachgekommen ist.\n\
3.3.4  Au\u00dferdem sind \u00c4nderungen statthaft, zu denen nach Treu und Glauben die Zustimmung nicht verweigert werden darf (\u00a7 39 Abs. 2 UrhG).\n\
\n\
3.4  Sicherungskopien\n\
3.4.1  Der Lizenznehmer ist berechtigt, Sicherungskopien der ihm \u00fcberlassenen Software im f\u00fcr die bestimmungsgem\u00e4\u00dfe Benutzung erforderlichen Umfang zu erstellen.\n\
3.4.2  Der Lizenznehmer hat auf der erstellten Sicherungskopie den Vermerk "Sicherungskopie" sowie einen Urheberrechtsvermerk des Herstellers deutlich sichtbar anzubringen.\n\
\n\
3.5  Unerlaubte Nutzungen\n\
3.5.1  \u00dcber die in Ziffer 3.1 bis 3.4 genannten F\u00e4lle hinaus ist der Lizenznehmer nicht zur Vervielf\u00e4ltigung oder sonstigen Nutzung der Software berechtigt.\n\
3.5.2  Der Lizenznehmer ist insbesondere nicht berechtigt, die ihm \u00fcbergebene Kopie der Software oder die gegebenenfalls erstellte Sicherungskopien Dritten zu \u00fcberlassen, die Software zu ver\u00e4u\u00dfern, zu verleihen, zu vermieten oder in sonstiger Weise unterzulizensieren, \u00f6ffentlich wiederzugeben oder zug\u00e4nglich zu machen.\n\
\n\
3.6  Rechtsfolgen bei unerlaubter Nutzung\n\
3.6.1  Verst\u00f6\u00dft der Lizenznehmer gegen die Lizenzbestimmungen, kann ihn die Yatta Solutions in Textform auffordern, den Versto\u00df innerhalb angemessener Frist auszur\u00e4umen. Kommt der Lizenznehmer nicht innerhalb der gesetzten Frist nach, kann die Yatta Solutions den Vertrag mit sofortiger Wirkung k\u00fcndigen. Mit der K\u00fcndigung fallen s\u00e4mtliche im Rahmen dieses Vertrags einger\u00e4umten Nutzungsrechte sofort an die Yatta Solutions zur\u00fcck.\n\
3.6.2  Die Verpflichtungen des Lizenznehmers richten sich in diesem Fall nach Ziffer 5.5; die Geltendmachung weiterer Rechte bleibt hiervon unber\u00fchrt.\n\
\n\
\n\
\n\
4. Lizenzpreise\n\
4.1  H\u00f6he der Lizenzpreise\n\
4.1.1  Soweit nicht anders vereinbart, ergibt sich die H\u00f6he der Lizenzpreise aus der jeweils aktuellen Preisliste der Yatta Solutions zum Zeitpunkt der Bestellung des Lizenznehmers.\n\
4.1.2  Alle Preise, die auf der Website der Yatta Solutions angegeben sind, verstehen sich - sofern nicht anders angegeben - zuz\u00fcglich der jeweils geltenden gesetzlichen Umsatzsteuer sowie sonstiger etwaig geltender Steuern, Z\u00f6lle und Abgaben.\n\
\n\
4.2  F\u00e4lligkeit\n\
4.2.1  Lizenzpreise sind - in voller H\u00f6he - innerhalb von 14 Tagen ab Rechnungsstellung zu zahlen.\n\
4.2.2  Bei Verl\u00e4ngerung der Lizenzdauer kann die Yatta Solutions dem Kunden die Rechnung f\u00fcr den Zeitraum, um den die Lizenzdauer verl\u00e4ngert ist, ab dem Zeitpunkt ausstellen, ab dem eine K\u00fcndigung des noch laufenden Lizenzzeitraums gem\u00e4\u00df Ziffer 6.2.3 nicht mehr m\u00f6glich ist. Auch in diesem Fall sind die Lizenzgeb\u00fchren innerhalb von 14 Tagen ab Rechnungsstellung zu zahlen.\n\
\n\
\n\
\n\
5. Verpflichtungen des Lizenznehmers\n\
5.1  Geistiges Eigentum der Yatta Solutions\n\
Der Lizenznehmer verpflichtet sich, die Rechte der Yatta Solutions und insbesondere geistiges Eigentum der Yatta Solutions zu achten, indem er\n\
(a)  die erlaubte Nutzung gem\u00e4\u00df Ziffer 3 weder qualitativ noch quantitativ \u00fcberschreitet,\n\
(b)  keine Kopien der Software an Dritte weitergibt oder Dritten die Herstellung von Kopien erm\u00f6glicht,\n\
(c)  keinerlei ungesetzliche oder vertragswidrige Manipulationen an der vertragsgegenst\u00e4ndlichen Software vornimmt oder erm\u00f6glicht.\n\
\n\
5.2  Schutz der Software\n\
Der Lizenznehmer ist verpflichtet, die Software sowie gegebenenfalls die Zugangsdaten und etwaige Lizenzschl\u00fcssel durch geeignete Ma\u00dfnahmen vor dem Zugriff durch unbefugte Dritte zu sichern. Insbesondere sind s\u00e4mtliche Kopien der Software und der Lizenzschl\u00fcssel an einem gesch\u00fctzten Ort zu verwahren.\n\
\n\
5.3  Beweislast\n\
Ist der Lizenznehmer Unternehmer (\u00a7 14 BGB), obliegt ihm die Beweislast, dass er die notwendigen organisatorischen Ma\u00dfnahmen ergriffen hat, damit die unerlaubte Nutzung der Software, insbesondere die unerlaubte Weitergabe, Vervielf\u00e4ltigung oder Ver\u00f6ffentlichung, durch Dritte in seinem Gefahrenbereich in angemessener Weise und angemessenem Umfang, mindestens  mit gleicher Sorgfalt unterbunden wird, die er zum Schutz eigener vertraulicher Informationen aufwendet.\n\
\n\
5.4  Auskunftspflicht\n\
Auf Verlangen hat der Lizenznehmer der Yatta Solutions Auskunft \u00fcber Anzahl und Einsatzort der bei ihm, seinen Erf\u00fcllungsgehilfen und Unterauftragnehmern genutzten Software zu geben.\n\
\n\
5.5  Verpflichtung nach Vertragsende\n\
Im Falle einer K\u00fcndigung, des Auslaufens der Lizenzdauer oder sonstigen Beendigung des Vertrages, hat der Lizenznehmer die Nutzung der Software unverz\u00fcglich und vollst\u00e4ndig einzustellen, s\u00e4mtliche installierten Kopien der Software zu l\u00f6schen, gegebenenfalls von der Yatta Solutions ausgeh\u00e4ndigte Kopien oder erstellte Sicherungskopien ebenfalls zu l\u00f6schen bzw. zu vernichten oder auszuh\u00e4ndigen, sowie - auf Verlangen der Yatta Solutions - eine rechtsverbindliche Erkl\u00e4rung hierzu abzugeben.\n\
\n\
\n\
\n\
6. Laufzeit und K\u00fcndigung\n\
6.1  Lizenzdauer\n\
6.1.1  Sofern nichts anderes vereinbart, betr\u00e4gt die Lizenzdauer f\u00fcr UML Lab ein Jahr, f\u00fcr UML Lab Services ein Monat, beginnend mit dem Tag des Vertragsschlusses.\n\
6.1.2  Innerhalb der Laufzeit kann der Vertrag nicht ordentlich gek\u00fcndigt werden.\n\
\n\
6.2  Verl\u00e4ngerung der Lizenzdauer\n\
6.2.1  Hat der Lizenznehmer die (automatische) Verl\u00e4ngerung der Lizenzdauer (z.B. per Mausklick im Webshop) vereinbart, verl\u00e4ngert sich die Lizenzdauer vorbehaltlich der Ziffer 12.3.2 nach ihrem Ablauf jeweils um eine weitere Nutzungsperiode. Im Zweifel verl\u00e4ngert sich die Lizenzdauer um die Dauer der letzten Verl\u00e4ngerung, alternativ um den Umfang der abgelaufenen Lizenzdauer.\n\
6.2.2  Ma\u00dfgeblich ist das Kalenderdatum. Bei Vertragsabschluss an einem 29. Februar, ist im Folgejahr der 28. Februar ma\u00dfgeblich.\n\
6.2.3  Der Vertrag kann im Falle der Vereinbarung der (automatischen) Verl\u00e4ngerung von jeder Partei mit einer Frist von sechs Wochen vor Ablauf der jeweils noch laufenden Lizenzdauer gek\u00fcndigt werden. Die Lizenzdauer endet in diesem Fall mit Ablauf des Jahres gem\u00e4\u00df Ziffer 6.1.1 oder 6.2.1.\n\
\n\
6.3  K\u00fcndigung aus wichtigem Grund\n\
Der Vertrag kann dar\u00fcber hinaus von jeder Partei ohne Einhaltung einer Frist aus wichtigem Grund gek\u00fcndigt werden.\n\
\n\
6.4  Form der K\u00fcndigung\n\
Jede K\u00fcndigung bedarf der Textform.\n\
\n\
\n\
\n\
7. Lieferung und Bereitstellung der Software\n\
7.1  Lieferung oder Bereitstellung der Software\n\
7.1.1  Die Yatta Solutions stellt dem Lizenznehmer die Software nach Vertragsschluss, sp\u00e4testens unverz\u00fcglich nach Zahlungseingang, im Wege des Downloads auf ihrer Website oder \u00fcber den Eclipse Marketplace zum Herunterladen \u00fcber das Internet bereit.\n\
7.1.2  F\u00fcr den Log-In in den gegebenenfalls gesch\u00fctzten Bereich des Internetauftritts teilt die Yatta Solutions dem Lizenznehmer die erforderlichen Zugangsdaten mit.\n\
7.1.3  Die Yatta Solutions ist berechtigt, anstelle des Downloads nach Ziffer 7.1.1 dem Lizenznehmer eine Kopie der vertragsgegenst\u00e4ndlichen Software sowie der zugeh\u00f6rigen Benutzerdokumentation auf einem geeigneten Datentr\u00e4ger zu \u00fcberlassen oder durch ein sonstiges geeignetes Medium in digitaler Form an den Lizenznehmer zu \u00fcbertragen.\n\
\n\
7.2  Unterst\u00fctzungssoftware\n\
7.2.1  Die Software der Yatta Solutions wird gegebenenfalls gemeinsam mit Unterst\u00fctzungssoftware anderer Anbieter lizensiert und geliefert bzw. bereitgestellt.\n\
7.2.2  Die Nutzung von Unterst\u00fctzungssoftware durch den Lizenznehmer richtet sich nach jeweils geltenden Lizenzbestimmungen; die Lizenzbestimmungen der Yatta Solutions haben gegen\u00fcber sonstigen Regelungen Vorrang.\n\
7.2.3  Unterst\u00fctzungssoftware sind insbesondere\n\
* ANTLR (New BSD License2),\n\
* Apache Foundation Libraries (Apache Software License 1.1 und 2.03),\n\
* ASM (Objectweb ASM License4),\n\
* CSS/Events/SMIL/SVG APIs (W3C Software License5),\n\
* Eclipse Bundles (EPL 1.06),\n\
* Google Collections/Guava/Inject/Gson (Apache Software License 2.0),\n\
* Hamcrest (New BSD License7),\n\
* ICU (ICU License8),\n\
* Java Extension APIs (CDDL 1.0),\n\
* Java Extension XML APIs (Apache Software License 2.0),\n\
* Java Servlet API (CDDL 1.0),\n\
* Jetty (Apache Software License 2.0),\n\
* Jdom (Jdom License9),\n\
* JGraph (BSD License),\n\ 
* Jsch (JCraft License10),\n\
* JSON (JSON.org License ),\n\
* Junit (Common Public License 1.011),\n\
* NSIS Installer (zlib/libpng12),\n\
* Neil Fraser Plaintext Diff/Match/Patch (Apache Software License 2.0)\n\
* Polarion SVN Connectors (EPL 1.0),\n\
* ROME Tools (Apache Software License 2.0),\n\
* LPG Java Runtime (EPL 1.0),\n\
* Sat4j (EPL/LGPL Dual License 1.013),\n\
* StringTemplate (BSD License),\n\
* SVNKit (TMate SVN Kit License  and others ),\n\
* Trove4j (LGPL 2.1 and others ),\n\
* yFiles Layouter (yFiles Java Project License14).\n\
* Yoda Time (Apache Software License 2.0).\n\
\n\
7.3  Bereitstellung der Lizenzschl\u00fcssel\n\
7.3.1  Zur Aktivierung des Softwareprodukts oder zur Freischaltung der vollen Funktionalit\u00e4t bedarf es der Eingabe des Lizenzschl\u00fcssels.\n\
7.3.2  Die Yatta Solutions wird dem Lizenznehmer die den erworbenen Rechten entsprechenden Lizenzschl\u00fcssel nach Zahlungseingang nach ihrer Wahl in geeigneter Form (Email, Brief, Download) zur Verf\u00fcgung stellen.\n\
7.3.3  Bis zur Eingabe des Lizenzschl\u00fcssels ist die Software nur eingeschr\u00e4nkt und allenfalls zeitlich befristet (max. 30 Tage) einsetzbar.\n\
\n\
\n\
\n\
8. Updates und Technischer Support\n\
8.1  Support Richtlinie\n\
8.1.1  Die Yatta Solutions bietet f\u00fcr ihre Produkte Updates und technischen Support nach Ma\u00dfgabe ihrer jeweils aktuellen Support Richtlinie (Anlage). Dies gilt nicht f\u00fcr unentgeltliche Lizenzen, insbesondere nicht f\u00fcr die FREE Trial.\n\
8.1.2  Im Falle der Verl\u00e4ngerung der Lizenzdauer gem\u00e4\u00df Ziffer 6.2 erkl\u00e4rt sich der Lizenznehmer mit der Geltung der jeweils durch die Yatta Solutions aktualisierten Support Richtlinie einverstanden.\n\
8.1.3  Der Lizenznehmer hat f\u00fcr die Bekanntmachung von \u00c4nderungen an der Support Richtlinie seine Email Adresse st\u00e4ndig zu aktualisieren.\n\
8.1.4  Ziffer 2.3 findet entsprechende Anwendung.\n\
\n\
8.2  Technischer Support\n\
8.2.1  Der Lizenznehmer ist w\u00e4hrend der Lizenzdauer zur unentgeltlichen Inanspruchnahme des technischen Supports berechtigt; Art und Umfang des gew\u00e4hrten technischen Supports bestimmen sich nach der jeweils aktuellen Support Richtlinie der Yatta Solutions (Ziffer 8.1).\n\
8.2.2  Ziffer 9.4 findet f\u00fcr die Inanspruchnahme des technischen Supports entsprechende Anwendung.\n\
\n\
8.3  Updates\n\
8.3.1  Die Yatta Solutions stellt zur kontinuierlichen Verbesserung ihrer Software Updates zur Verf\u00fcgung. Der Lizenznehmer ist w\u00e4hrend der Lizenzdauer vorbehaltlich der Ziffer 12.3.2 zur unentgeltlichen Nutzung von Updates berechtigt.\n\
8.3.2  Die Yatta Solutions stellt dem Lizenznehmer Updates im Wege des Downloads etwaiger Releases und Patches auf ihrer Website15 bzw. Updatesite16 zum Herunterladen \u00fcber das Internet bereit. F\u00fcr den Log-In in den gegebenenfalls gesch\u00fctzten Bereich des Internetauftritts teilt die Yatta Solutions dem Lizenznehmer die erforderlichen Zugangsdaten mit. Die Yatta Solutions ist berechtigt, anstelle des Downloads dem Lizenznehmer Releases und Updates auf einem geeigneten Datentr\u00e4ger zu \u00fcberlassen oder durch ein sonstiges geeignetes Medium in digitaler Form zu \u00fcbertragen.\n\
8.3.3  Gegenstand des technischen Supports gem\u00e4\u00df Ziffer 8.2 ist, sofern in der Support Richtlinie nicht anders angegeben, ausschlie\u00dflich die jeweils aktuelle Softwareversion nach Installation s\u00e4mtlicher aktueller Updates.\n\
\n\
\n\
\n\
9. Gew\u00e4hrleistung\n\
9.1  Allgemeines zur Gew\u00e4hrleistung\n\
9.1.1  Die Yatta Solutions leistet, vorbehaltlich der Regelungen f\u00fcr unentgeltliche Lizenzen in Ziffer 11, Gew\u00e4hr nach Ma\u00dfgabe der folgenden Bestimmungen. Die Tauglichkeit der Software f\u00fcr einen bestimmten Zweck wird nicht gew\u00e4hrleistet; besondere Eigenschaften sind nicht zugesichert. Ziffer 2.2 ist zu ber\u00fccksichtigen.\n\
9.1.2  Auf die M\u00f6glichkeit, die Software vor Erwerb durch die FREE Trial ausgiebig zu testen wird der Lizenznehmer hingewiesen.\n\
\n\
9.2  Umfang der Gew\u00e4hrleistung\n\
9.2.1  Die Yatta Solutions leistet Gew\u00e4hr f\u00fcr die Aufrechterhaltung der vertraglich vereinbarten Beschaffenheit der Software w\u00e4hrend der Vertragslaufzeit (Lizenzdauer) sowie daf\u00fcr, dass einer vertragsgem\u00e4\u00dfen Nutzung der Software keine Rechte Dritter entgegenstehen.\n\
9.2.2  Die Yatta Solutions wird auftretende Sach- und Rechtsm\u00e4ngel an der Software nach entsprechender Mitteilung des Lizenznehmers in angemessener Zeit beseitigen. Etwaige Fehler werden nach Wahl der Yatta Solutions durch kostenfreie Nachbesserung oder Ersatzlieferung, insbesondere durch Lieferung, \u00dcbermittlung oder Bereitstellung eines Updates, mittels eines Patches oder Releases oder durch Mitteilung eines Work Arounds behoben.\n\
9.2.3  Der Lizenznehmer hat ein K\u00fcndigungsrecht nach \u00a7 543 Absatz 2 Satz 1 Nr. 1 BGB wegen Nichtgew\u00e4hrung des Gebrauchs nur, sofern die Nachbesserung oder Ersatzlieferung fehlgeschlagen ist. Ein solches Fehlschlagen liegt erst dann vor, wenn die Yatta Solutions hinreichende Gelegenheit zur Nachbesserung oder Ersatzlieferung hatte, wenn sie unm\u00f6glich ist, wenn sie von der Yatta Solutions verweigert oder unzumutbar verz\u00f6gert wird, wenn begr\u00fcndete Zweifel hinsichtlich der Erfolgsaussichten bestehen oder wenn eine Unzumutbarkeit aus sonstigen Gr\u00fcnden vorliegt.\n\
\n\
9.3  Sonderregelungen f\u00fcr Unternehmer\n\
Ist der Lizenznehmer Unternehmer (\u00a7 14 BGB), so hat er die Software unverz\u00fcglich, d.h. sp\u00e4testens innerhalb von drei Tagen nach Lieferung auf erkennbare M\u00e4ngel zu untersuchen und, sobald sich ein Mangel zeigt, der Yatta Solutions unverz\u00fcglich schriftlich anzuzeigen. Ansonsten ist eine Gew\u00e4hrleistung f\u00fcr solche erkennbare M\u00e4ngel ausgeschlossen. Entsprechendes gilt, wenn sich ein solcher Mangel sp\u00e4ter zeigt. Als Lieferung gilt auch die Bereitstellung von Software zum Herunterladen von einem Server \u00fcber das Internet durch den Lizenznehmer.\n\
\n\
9.4  Mitwirkungspflichten des Lizenznehmers\n\
9.4.1  Dem Lizenznehmer obliegt es, auftretende Fehler und deren Symptome bestm\u00f6glich zu beschreiben, damit deren Reproduzierbarkeit - und damit auch die nachfolgende Beseitigung - erm\u00f6glicht wird. Dabei sind Zeitpunkte des Auftretens und n\u00e4here Umst\u00e4nde etwaiger M\u00e4ngel hinreichend konkret zu beschreiben.\n\
9.4.2  Die Fehlerbeschreibung sollte hinsichtlich Inhalt, Form, Art und Umfang und Inhalt nach n\u00e4herer Ma\u00dfgabe der Support Richtlinie der Yatta Solutions gem\u00e4\u00df Ziffer 8.1 erfolgen. Die Yatta Solutions wird hierf\u00fcr geeignete Medien und Instrumente (z.B. Email Adresse, Telefonsupport, Trouble-Ticket-System oder Support Forum) nach eigenem Ermessen vorhalten.\n\
\n\
\n\
\n\
10. Haftung\n\
10.1  Haftung\n\
10.1.1  Die Yatta Solutions haftet gegen\u00fcber Verbrauchern (\u00a7 13 BGB) nach Ma\u00dfgabe der lit. (a) und gegen\u00fcber Unternehmern (\u00a7 14 BGB) nach Ma\u00dfgabe der lit. (b):\n\
(a)  Eine unbeschr\u00e4nkte Haftung besteht gegen\u00fcber Verbrauchern bei Vorsatz, grober Fahrl\u00e4ssigkeit, f\u00fcr die Verletzung des Lebens, des K\u00f6rpers oder der Gesundheit sowie im Umfang einer etwaig \u00fcbernommenen Garantie. Soweit durch leichte Fahrl\u00e4ssigkeit eine wesentliche Vertragspflicht (Kardinalpflicht gem\u00e4\u00df 10.1.2) verletzt wurde, \u00fcbernimmt die Yatta Solutions eine auf den vertragstypischen, vorhersehbaren Schaden beschr\u00e4nkte Haftung.\n\
(b)  Eine unbeschr\u00e4nkte Haftung besteht gegen\u00fcber Unternehmern bei Vorsatz, der grob fahrl\u00e4ssigen Verletzung einer wesentlichen Vertragspflicht (Kardinalpflicht gem\u00e4\u00df 10.1.2), f\u00fcr die Verletzung des Lebens, des K\u00f6rpers oder der Gesundheit sowie im Umfang einer etwaig \u00fcbernommenen Garantie. Soweit durch leichte Fahrl\u00e4ssigkeit eine Kardinalpflicht verletzt wurde oder soweit eine Vertragspflicht, die keine Kardinalpflicht darstellt, grob fahrl\u00e4ssig verletzt wurde, \u00fcbernimmt die Yatta Solutions eine auf den vertragstypischen, vorhersehbaren Schaden beschr\u00e4nkte Haftung.\n\
10.1.2  Kardinalpflichten sind solche, deren Erf\u00fcllung zur Erreichung des Ziels des Vertrags notwendig ist und auf deren Erf\u00fcllung die Parteien daher vertrauen.\n\
10.1.3  Selbst soweit eine Haftung gem\u00e4\u00df der Ziffer 10.1.1 besteht, ist die Haftung f\u00fcr Datenverluste gegen\u00fcber Verbrauchern und Unternehmern zudem auf den Wiederherstellungsaufwand beschr\u00e4nkt, der bei Durchf\u00fchrung ordnungsgem\u00e4\u00dfer und gefahrengerechter Datensicherungsma\u00dfnahmen gem\u00e4\u00df Ziffer 10.3.2 angefallen w\u00e4re.\n\
10.1.4  Die Haftungsausschl\u00fcsse und -beschr\u00e4nkungen aus den Ziffern 10.1.1 bis 10.1.3 finden auch auf Sch\u00e4den Anwendung, die auf einem anf\u00e4nglichen Mangel der Software beruhen.\n\
10.1.5  Die Vorschriften des Produkthaftungsgesetzes bleiben unber\u00fchrt.\n\
\n\
10.2  Haftungsausschluss\n\
10.2.1  \u00dcber die Bestimmungen der Ziffer 10.1 hinaus ist die Haftung der Yatta Solutions - gleich aus welchem Rechtsgrund - ausgeschlossen.\n\
10.2.2  Dies gilt insbesondere auch f\u00fcr die Haftung f\u00fcr entgangenen Gewinn, ausgebliebene Einsparungen, Sch\u00e4den aus Anspr\u00fcchen Dritter oder f\u00fcr sonstige mittelbare oder unmittelbare Folgesch\u00e4den.\n\
\n\
10.3  Schadensminderung und Mitverschulden\n\
10.3.1  Der Kunde ist zu allen erforderlichen und angemessenen Handlungen verpflichtet, um einen etwaigen Schaden abzuwenden oder zu mindern.\n\
10.3.2  Insbesondere ist der Lizenznehmer verpflichtet, seine Daten in angemessenen Abst\u00e4nden, mindestens t\u00e4glich, zu sichern, seine Systeme durch angemessene vorbeugende Ma\u00dfnahmen und regelm\u00e4\u00dfige Tests gegen Viren und sonstige Schadsoftware zu sch\u00fctzen, und Software im erforderlichen und angemessenen Umfang sorgf\u00e4ltig zu testen.\n\
\n\
10.4  Erf\u00fcllungsgehilfen und Vertreter der Yatta Solutions\n\
Die vorstehenden Haftungsbeschr\u00e4nkungen der Ziffer 10 gelten auch f\u00fcr die pers\u00f6nliche Haftung der Organe, Mitarbeiter und Erf\u00fcllungsgehilfen der Yatta Solutions.\n\
\n\
\n\
\n\
11. unentgeltliche Lizenzen\n\
11.1  Unentgeltliche Lizenzen\n\
Die Yatta Solutions bietet unentgeltliche Lizenzen zu ausdr\u00fccklich benannten Zwecken, insbesondere\n\
eine UML Lab FREE Trial zum Testen von UML Lab f\u00fcr Interessenten sowie zu Marketingzwecken,\n\
eine UML Lab Academic License f\u00fcr Forschung und Lehre,\n\
etwaige Betaversionen zum Testen von neuen Versionen der Software vor der Ver\u00f6ffentlichung etwaiger regul\u00e4rer Updates.\n\
\n\
11.2  Sonderregelungen zu Support, Haftung und Gew\u00e4hrleistung\n\
11.2.1  Die Yatta Solutions gew\u00e4hrleistet bei unentgeltlichen Lizenzen keinen technischen Support (Ziffer 8.2) und bietet keine Gew\u00e4hrleistung oder Haftung gem\u00e4\u00df den Ziffern 9 oder 10.\n\
11.2.2  Yatta Solutions haftet nur, soweit Vorsatz oder grobe Fahrl\u00e4ssigkeit vorliegen oder bietet Gew\u00e4hrleistung, wenn sie den betreffenden Mangel arglistig verschwiegen hat. Die Haftung f\u00fcr grobe Fahrl\u00e4ssigkeit ist beschr\u00e4nkt auf vertragstypischen, vorhersehbaren Schaden, es sei denn, es handelt sich um Schadensersatzanspr\u00fcche des Lizenznehmers f\u00fcr die Verletzung des Lebens, des K\u00f6rpers oder der Gesundheit.\n\
11.2.3  Die Vorschriften des Produkthaftungsgesetzes bleiben unber\u00fchrt.\n\
11.2.4  Die Ziffern 10.1.3 und 10.4 finden Anwendung.\n\
\n\
12. Schlussbestimmungen\n\
12.1  Formumwandlung und Abtretung von Rechten\n\
12.1.1  Rechte und Pflichten aus dem Vertrag werden durch Formumwandlung bzw. Neustrukturierungen der Betriebsorganisation der Parteien, auch wenn diese zur Ausgliederung von Betriebsteilen oder zur Schaffung neuer Rechtspers\u00f6nlichkeiten f\u00fchren, nicht ber\u00fchrt.\n\
12.1.2  Im \u00dcbrigen ist der Kunde zur Abtretung von Rechten aus seiner Gesch\u00e4ftsbeziehung mit der Yatta Solutions nicht befugt.\n\
\n\
12.2  Aufrechnung und Zur\u00fcckbehaltungsrecht\n\
12.2.1  Der Kunde darf nur mit unbestrittenen oder rechtskr\u00e4ftig festgestellten Forderungen gegen\u00fcber der Yatta Solutions aufrechnen.\n\
12.2.2  Ist der Kunde Unternehmer (\u00a7 14 BGB), so ist er nur im Hinblick auf unbestrittene oder rechtskr\u00e4ftig festgestellte Forderungen aus dem Vertrag zur Aus\u00fcbung von Zur\u00fcckbehaltungsrechten berechtigt.\n\
\n\
12.3  Nebenabreden, Aktualisierung der Lizenzbestimmungen und Schriftform\n\
12.3.1  S\u00e4mtliche in diesem Vertrag genannten Anlagen (Funktionsbeschreibung, Lizenzarten, Lizenzschein, Preisliste, Support Richtlinie) sowie erg\u00e4nzende Bestimmungen (z.B. Webshop AGB f\u00fcr den Fall des Erwerbs \u00fcber den Yatta Solutions Webshop) sind Vertragsbestandteil.\n\
12.3.2  Die Yatta Solutions beh\u00e4lt sich vor bei neuen Releases, Patches, Updates oder Verl\u00e4ngerung der Lizenzdauer diese Lizenzbestimmungen zu aktualisieren. Der Lizenznehmer wird auf die Aktualisierung hingewiesen und zur Zustimmung aufgefordert. Au\u00dfer im Fall der Gew\u00e4hrleistung gem\u00e4\u00df Ziffer 9, ist der Lizenznehmer ohne seine Zustimmung nicht zur Nutzung der Releases, Patches, Updates oder zur Verl\u00e4ngerung der Lizenzdauer berechtigt; er ist bis zum Ablauf der jeweils noch bestehenden Lizenzdauer zur weiteren Nutzung der Software berechtigt.\n\
12.3.3  Sonstige \u00c4nderungen und Erg\u00e4nzungen des Vertrages bed\u00fcrfen der Schriftform; dies gilt auch f\u00fcr die \u00c4nderung der Schriftformklausel selbst. Abweichende Bedingungen des Lizenznehmers werden nicht anerkannt, es sei denn, die Yatta Solutions stimmt ihrer Geltung ausdr\u00fccklich schriftlich zu.\n\
\n\
12.4  Termine\n\
Eventuell genannte Termine f\u00fcr Lieferung, Installation, Updates oder Support sind unverbindlich, sofern nicht ausdr\u00fccklich etwas anderes bestimmt ist.\n\
\n\
12.5  Datenschutz\n\
12.5.1  Die Yatta Solutions beachtet die Vorschriften des Bundesdatenschutzgesetzes und des Telemediengesetzes.\n\
12.5.2  Im \u00dcbrigen wird in Bezug auf Einwilligungen des Lizenznehmers und weitere Informationen zur Datenerhebung, -verarbeitung und -nutzung auf die Datenschutzerkl\u00e4rung verwiesen, die auf der Website der Yatta Solutions jederzeit \u00fcber den Link Datenschutz in druckbarer Form abrufbar ist.\n\
12.5.3  Salvatorische Klausel\n\
12.5.4  Sollte eine Bestimmung des Vertrages unwirksam sein, wird die Wirksamkeit der \u00fcbrigen Bestimmungen dadurch nicht ber\u00fchrt.\n\
12.5.5  Die Parteien verpflichten sich, die unwirksame Bestimmung unverz\u00fcglich durch eine solche wirksame ersetzen, die dem wirtschaftlichen Zweck der unwirksamen Bestimmung am n\u00e4chsten kommt.\n\
\n\
\n\
\n\
12.6  Geltendes Recht und Gerichtsstand\n\
12.6.1  Es findet ausschlie\u00dflich das Recht der Bundesrepublik Deutschland Anwendung.\n\
12.6.2  Sofern der Kunde Kaufmann, eine juristische Person des \u00f6ffentlichen Rechts oder ein \u00f6ffentlich-rechtliches Sonderverm\u00f6gen ist, ist ausschlie\u00dflicher Gerichtsstand f\u00fcr alle Streitigkeiten aus Vertragsverh\u00e4ltnissen zwischen dem Lizenznehmer und der Yatta Solutions Kassel.\n\
\n\
\n\
\n\
UML Lab\n\
Anlage Lizenz- und Nutzungsarten\n\
Die Yatta Solutions bietet UML Lab in verschiedenen Editionen gem\u00e4\u00df den folgenden Spezifikationen und Nutzungseinschr\u00e4nkungen an:\n\
\n\
1. Allgemeine Bestimmungen zu den Lizenzarten\n\
1.1  Einzelplatzlizenzen\n\
1.1.1  Soweit nicht anders angegeben bezieht sich eine Lizenz mit einem Lizenzschl\u00fcssel jeweils auf einen bestimmten Nutzer (Anwender) und Arbeitsplatzrechner (Ger\u00e4t) des Lizenznehmers (Einzelplatzlizenz); der Anwender muss eine berechtigte Person gem\u00e4\u00df Ziffer 1.3 sein. Die Anzahl an installierten oder sonst irgendwie genutzten Versionen der Software darf die Anzahl an Lizenzen bzw. Lizenzschl\u00fcsseln nicht \u00fcbersteigen.\n\
1.1.2  Regelungen zur Anfertigung von Sicherungskopien bleiben von der Ziffer 1.1 unber\u00fchrt.\n\
\n\
1.2  Floating Licenses\n\
1.2.1  Floating Licenses d\u00fcrfen von allen berechtigten Personen gem\u00e4\u00df Ziffer 1.3 entsprechend der Anzahl an Lizenzen zeitgleich genutzt werden. Der Lizenznehmer darf unabh\u00e4ngig von dieser Anzahl die Software auf beliebig vielen Ger\u00e4ten innerhalb seines Betriebs gem\u00e4\u00df Ziffer 1.3.2 installieren.\n\
1.2.2  Zur Nutzung von Floating Licenses muss der Lizenznehmer die Lizenzverwaltungssoftware zu UML Lab auf einem geeigneten Ger\u00e4t (Server) installieren. Zur Aktivierung oder zur Freischaltung der Lizenzverwaltungssoftware bedarf es der Eingabe des Volumenlizenzschl\u00fcssels. Lizenzverwaltungssoftware und Volumenlizenzschl\u00fcssel d\u00fcrfen nur auf einem einzigen Server genutzt werden.\n\
1.2.3  Die Lizenzverwaltungssoftware vergibt zur Nutzung der Software Floating Client Licenses an die jeweiligen Ger\u00e4te der Anwender (Clients). Die Clients m\u00fcssen zum Austausch (Vergabe oder R\u00fcckgabe) der Floating Client Licenses eine Netzwerk-Verbindung zum Server herstellen.\n\
\n\
1.3  Berechtigter Personenkreis\n\
1.3.1  Berechtigt zur Nutzung gem\u00e4\u00df den Lizenzbestimmungen sind der Lizenznehmer selbst sowie seine Mitarbeiter innerhalb desselben Betriebs einschlie\u00dflich freier Mitarbeiter, die im selben Betrieb t\u00e4tig sind (zusammen berechtigte Personen).\n\
1.3.2  Betrieb ist ein abgrenzbarer Unternehmensteil (z.B. ein Unternehmensstandort, eine Abteilung oder ein Gesch\u00e4ftsbereich wie etwa ein Entwicklungsteam). Bei Unternehmen mit bis zu 100 Mitarbeitern und mit einem Standort ist Betrieb stets das gesamte Unternehmen.\n\
\n\
1.4  Sonstige Bestimmungen\n\
1.4.1  UML Lab entspricht im \u00dcbrigen der beiliegenden Funktionsbeschreibung.\n\
1.4.2  Im \u00dcbrigen gelten die Allgemeinen Lizenzbestimmungen; diese gehen im Zweifel den Anlagen Lizenzarten und Funktionsbeschreibung vor.\n\
\n\
\n\
\n\
2. Allgemeine Lizenzarten\n\
2.1  Desktop Edition\n\
2.1.1  Die Desktop Edition ist eine Version der Software, f\u00fcr die Lizenzen zum Betrieb auf jeweils nur einem Ger\u00e4t f\u00fcr jeweils nur einen Nutzer gem\u00e4\u00df Ziffer 1.1 einger\u00e4umt werden.\n\
2.1.2  Die Desktop Edition ist in der Funktionalit\u00e4t beschr\u00e4nkt und unterst\u00fctzt keine Versionsverwaltung. Versionierte Dateien (z.B. Quelltext-Dateien, Modell-Dateien, etc.) k\u00f6nnen nicht mit der Software eingelesen oder bearbeitet werden.\n\
\n\
2.2  Professional Edition\n\
2.2.1  Die Professional Edition ist ebenfalls eine Version der Software, f\u00fcr die Lizenzen zum Betrieb auf jeweils nur einem Ger\u00e4t f\u00fcr jeweils nur einen Nutzer gem\u00e4\u00df Ziffer 1.1 einger\u00e4umt werden.\n\
2.2.2  Die Professional Edition ist in der Funktionalit\u00e4t nicht beschr\u00e4nkt und unterst\u00fctzt verschiedene Versionsverwaltungssysteme; die Lizenzverwaltungssoftware f\u00fcr  Volumenlizenzen ist in der Professional Edition nicht Teil der Software.\n\
\n\
2.3  Corporate Edition\n\
2.3.1  Die Corporate Edition ist eine Version der Software, die f\u00fcr den Server-Client-Einsatz mittels einer Volumenlizenz mit Floating Licenses gem\u00e4\u00df Ziffer 1.2 bestimmt ist.\n\
2.3.2  Die Corporate Edition umfasst eine Lizenzverwaltungssoftware f\u00fcr jeweils einen Server und wird mit einem Volumenlizenzschl\u00fcssel f\u00fcr die entsprechende Anzahl an Floating Licenses geliefert.\n\
\n\
\n\
\n\
3. Besondere Lizenz- und Nutzungsarten\n\
3.1  Customized Edition\n\
3.1.1  Die Customized Edition ist eine besondere Version der Software, die jeweils f\u00fcr einen bestimmten Lizenznehmer gem\u00e4\u00df separater Beratungsvereinbarung angepasst und durch die Yatta Solutions entsprechend den Lizenzvereinbarungen gewartet und gepflegt wird.\n\
3.1.2  Je nach konkreter Vereinbarung ist die Customized Edition sowohl als Einzelplatzlizenzen oder als Floating Licenses verf\u00fcgbar. N\u00e4heres ergibt sich aus dem Lizenzschein.\n\
\n\
3.2   UML Lab Services\n\
3.2.1 UML Lab Services sind jeweils bestimmte Versionen der Software zum Betrieb auf jeweils nur einem Ger\u00e4t f\u00fcr jeweils nur einen Nutzer gem\u00e4\u00df Ziffer 1.1.\n\
3.2.2 UML Lab Services sind in der Regel in der Funktionalit\u00e4t beschr\u00e4nkt; die einzelnen Services k\u00f6nnen hierbei beliebig miteinander kombiniert werden. Die Lizenz- und Nutzungsdauer von UML Lab Services ist gem\u00e4\u00df Ziffer 6.1 der Allgemeinen Lizenzbestimmungen auf maximal einen Monat beschr\u00e4nkt. Yatta Solutions kann f\u00fcr bestimmte UML Lab Services auch eine k\u00fcrzere Lizenzdauer oder eine andere Art der Nutzung anbieten und wird hierauf gegebenenfalls in ihrem Angebot ausdr\u00fccklich hinweisen.\n\
3.2.3 Aktuell werden folgende UML Lab Services angeboten:\n\
*  UML Lab Klassendiagramme\n\
Der UML Lab Service f\u00fcr Klassendiagramme erweitert die Eclipse IDE um den UML Lab Editor f\u00fcr UML Klassen- und Paketdiagramme nach Ma\u00dfgabe der Funktionsbeschreibung zu UML Lab. (Hinweis: Funktionen zur Codegenerierung, template-basiertes Reverse- oder Round-Trip-EngineeringNG oder Templates hierf\u00fcr sind in diesem UML Lab Service nicht enthalten.)\n\
*  UML Lab Pro Service\n\
Der Funktionsumfang entspricht dem von UML Lab Professional Edition (Ziffer 2.2.2).\n\
\n\
\n\
\n\
4. unentgeltliche Lizenzarten\n\
4.1  FREE Trial und Betaversionen\n\
4.1.1  Die UML Lab FREE Trial sowie etwaige Betaversionen dienen dem Testen der Software; sie sind nicht f\u00fcr den Produktivbetrieb bestimmt. Die Nutzung der UML Lab FREE Trial erfordert zur Nutzung regelm\u00e4\u00dfig eine Registrierung; Yatta Solutions erhebt hierzu personenbezogene Daten nach n\u00e4herer Ma\u00dfgabe der Yatta Solutions Datenschutzerkl\u00e4rung (Vgl. http://www.yatta.de/datenschutz/).\n\
4.1.2  Sofern nicht anders angegeben, betr\u00e4gt die Lizenzdauer f\u00fcr die UML Lab FREE Trial oder eine Betaversion abweichend von Ziffer 6.1.1 der Allgemeinen Lizenzbestimmungen 30 Tage im Falle einer FREE Trial f\u00fcr UML Lab Services nur ein Tag. Nach Ablauf der Lizenzdauer f\u00fcr die FREE Trial ist ein Anwender bis zum Ablauf von einem weiteren Jahr nicht mehr berechtigt eine weitere FREE Trial zu nutzen.\n\
4.1.3  Betaversionen sind keine regul\u00e4ren Releases der Software, sondern besondere Ver\u00f6ffentlichungen f\u00fcr den freiwilligen Vorab-Testbetrieb durch fortgeschrittene Anwender. Sie d\u00fcrfen daher nur in einer geeigneten Testumgebung eingesetzt werden.\n\
\n\
4.2  Academic License\n\
4.2.1  Die Academic License ist eine besondere Lizenzform f\u00fcr Forschung und Lehre. Der Einsatz zu kommerziellen Zwecken ist nicht gestattet.\n\
4.2.2  Abweichend von Ziffer 1.3 sind zur Nutzung der Software unter der Academic License nur Hochschulen und Schulen, deren Mitarbeiter aus den Bereichen Forschung und Lehre sowie Sch\u00fcler und Studenten von solchen Einrichtungen berechtigt; Ziffer 1.3 Satz 1 findet entsprechende Anwendung.\n\
4.2.3  Zur Inanspruchnahme der Academic License ist eine Registrierung der Hochschule oder Schule bei der Yatta Solutions erforderlich. Nach genehmigter Registrierung stellt die Yatta Solutions Lizenzen im angemessenen Umfang nach n\u00e4herer Ma\u00dfgabe der Vereinbarungen der Parteien wie im Lizenzschein niedergelegt f\u00fcr Forschung und Lehre zur Verf\u00fcgung.\n\
4.2.4  Die Yatta Solutions kann die Software unter der Academic License nach ihrer Wahl sowohl in Form von Einzelplatzlizenzen als auch als Floating Licenses zur Verf\u00fcgung stellen. Yatta Solutions kann Floating Licenses \u00fcber einen eigenen Server bereitstellen; sie kann die Nutzung der Client Licenses auf ein Netzwerk mit einer bestimmten IP-Adresse oder -Reichweite beschr\u00e4nken oder die sogenannte Lease Time f\u00fcr die Nutzung au\u00dferhalb des Netzwerks begrenzen. Die Yatta Solutions wird hierbei auf die Interessen der Lizenznehmer und Nutzer angemessen R\u00fccksicht nehmen.\n\
\n\
\n\
\n\
UML Lab\n\
Funktionsbeschreibung\n\
UML Lab ist eine in die Open-Source Entwicklungsumgebung Eclipse integrierte Modeling IDE zum Modellieren und Programmieren von Software. Die Software erweitert die Eclipse IDE um ein Werkzeug zum visuellen Modellieren von Software und zum Abgleichen von Modell und Quelltext.\n\
\n\
1. Klassendiagramm Editor\n\
UML Lab umfasst einen Editor zum Modellieren von Software mittels Diagrammen nach Vorgabe der UML Spezifikation.\n\
1.1  Funktionsumfang des UML Lab Modeling Editors\n\
Der UML Lab Diagramm Editor erm\u00f6glicht das Anlegen, Anzeigen, \u00c4ndern und Abspeichern von Diagrammdateien mit folgenden Syntaxelementen der UML.\n\
Association \n\
Aggregation \n\
Class \n\
Composition \n\
Dependency\n\
Enumeration\n\
Extension \n\
Generalization \n\
Interface \n\
InterfaceRealization \n\
Package \n\
PackageImport\n\
Stereotype\n\
Usage\n\
\n\
Ferner werden sekund\u00e4re Elemente wie etwa Property, Operation, Literal, u.a. unterst\u00fctzt.\n\
\n\
1.2  Bedienungsfunktionalit\u00e4t\n\
Die Bedienung des Diagramm Editors erfolgt durch Maus und Tastatur. Das Hinzuf\u00fcgen von Elementen in ein Diagramm erfolgt durch die Werkzeugpalette am rechten Diagrammrand oder durch Mausgesten. Das L\u00f6schen selektierter Elemente erfolgt durch Tastatur oder das Hauptmen\u00fc.\n\
\n\
\n\
\n\
2. Round-Trip-EngineeringNG\n\
Das Round-Trip-Engineering von UML Lab verwendet sowohl zur Codegenerierung als auch zum Reverse Engineering sogenannte Textvorlagen (Templates). Die Templates k\u00f6nnen vom Anwender erstellt und/oder bearbeitet werden; zus\u00e4tzlich werden Templates mit UML Lab mitgeliefert. Durch Round-Trip-EngineeringNG k\u00f6nnen Modell und Quelltext durch folgende Funktionen miteinander abgeglichen werden.\n\
2.1  Codegenerierung\n\
UML Lab verwendet zur Codegenerierung diverse Eclipse Technologien (v.a. Xpand/Xtend). Der Codegenerator verarbeitet Syntaxelemente der UML, wie sie in Abschnitt 1.1 n\u00e4her beschrieben sind, und generiert hieraus mittels Templates Quelltext. Zur Konfiguration des Codegenerators werden Templates der Templatesprache Xpand eingesetzt.\n\
\n\
2.2  Template-basiertes Reverse Engineering\n\
Zum Reverse Engineering werden alle verf\u00fcgbaren Templates mit dem einzulesenden Quelltext abgeglichen. Dabei versucht der Mechanismus, ein Modell zu rekonstruieren, welches den eingelesenen Quelltext wieder generiert. Ist bereits ein Modell vorhanden, wird versucht, dieses mit m\u00f6glichst wenigen \u00c4nderungen so anzupassen, dass das Ergebnis den eingelesenen Quelltext generiert.\n\
\n\
(a)  Grenzen von template-basiertem Reverse Engineering\n\
Die M\u00f6glichkeit, Modelle mittels Templates aus vorhandenem Quelltext vollst\u00e4ndig und eindeutig zu konstruieren, ist aus mathematischen Gr\u00fcnden nicht unbeschr\u00e4nkt gegeben. Das Reverse Engineering von UML Lab f\u00fchrt zu vollst\u00e4ndigen und eindeutigen Ergebnissen soweit...\n\
die in Templates verwendeten Ausdr\u00fccke (siehe Abschnitt 2.3) eindeutig umkehrbar sind,\n\
partielle Informationen, die zu jeweils einer Quelltextdatei ermittelt werden, zu einem vollst\u00e4ndigen Modell kombiniert werden k\u00f6nnen oder\n\
partielle Informationen zur lokalen Ver\u00e4nderung eines bestehenden Modells verwendet werden k\u00f6nnen, ohne dass Widerspr\u00fcche beim erneuten Codegenerieren auftreten w\u00fcrden.\n\
UML Lab \u00fcberpr\u00fcft stets, ob der vorhandene Quelltext in der vorliegenden Form aus dem Modell generiert werden kann. Falls obige Bedingungen verletzt sind, f\u00fchrt das Reverse Engineering zu keinen oder suboptimalen Ergebnissen.\n\
Werden Ergebnisse zu einem einzelnen Modellelement aus mehreren Quelltextdateien ermittelt, so werden diese mengenartig vereinigt. Bei Widerspr\u00fcchen zwischen einzelnen Ergebnissen ist die zuletzt verarbeitete Quelltextdatei ma\u00dfgeblich.\n\
\n\
(b)  Verhalten bei Abweichungen\n\
Treten Abweichungen zwischen Modell und Quelltext auf, f\u00fchrt UML Lab den Anwender zu einem Fehlerdialog um festzustellen, wie hiermit umzugehen ist. Der Anwender erh\u00e4lt die M\u00f6glichkeit, aufgetretene Abweichungen zwischenzuspeichern und fortlaufend in die Codegenerierung einflie\u00dfen zu lassen, oder alternativ die am Modell vorgenommenen \u00c4nderungen r\u00fcckg\u00e4ngig zu machen.\n\
In Einzelf\u00e4llen kann das Reverse Engineering zu gegebenen Quelltextdateien gar kein Ergebnis liefern und es werden keine zugeh\u00f6rigen Elemente im Modell angelegt. Die vorhandene Quelltextdatei wird anschlie\u00dfend nicht durch den Codegenerator \u00fcberschrieben.\n\
\n\
2.3  Templates\n\
Zum template-basierten Round-Trip-Engineering kommt eine Teilmenge der Templatesprache Xpand zum Einsatz. Folgende Sprachkonstrukte aus Xpand werden unterst\u00fctzt:\n\
IMPORT\n\
EXTENSION\n\
FILE\n\
EXPAND\n\
FOREACH\n\
IF\n\
LET\n\
Anmerkung: Zum Reverse Engineering muss sich der Dateiname der FILE Anweisung aus dem Inhalt der generierten Datei ergeben.\n\
Zus\u00e4tzlich werden folgende Sprachkonstrukte der Ausdruckssprache Xtend unterst\u00fctzt:\n\
Extension (ausgenommen Create-~)\n\
Select\n\
Typeselect\n\
Mengenoperationen: union, toList, size, get, indexOf, contains, isEmpty\n\
Switch\n\
Cast\n\
Die Verwendung weiterer Sprachkonstrukte aus Xtend ist zur Codegenerierung zul\u00e4ssig; diese werden jedoch nicht durch das Reverse Engineering von UML Lab verarbeitet. In diesem Fall ist es gegebenenfalls nicht m\u00f6glich das vollst\u00e4ndige Modell aus dem Quelltext zu erzeugen.\n\
\n\
2.4  Bedienung von Round-Trip-EngineeringNG\n\
Die Verwendung des Round-Trip-EngineeringNG erfolgt anhand verschiedener Wizards, die vom Anwender \u00fcber das Hauptmen\u00fc bzw. das Kontextmen\u00fc erreicht werden. Zudem kann durch Drag & Drop der entsprechenden Dateien, Quelltext durch template-basiertes Reverse Engineering eingelesen werden.\n\
Nach vorherigem Round-Trip-Engineering wird bei manuellen \u00c4nderungen einer Quelltextdatei automatisch ein Code-Modell Abgleich vorgenommen, gleiches gilt bei \u00c4nderungen im Modell. Der Abgleich erfolgt standardm\u00e4\u00dfig zum Zeitpunkt des Speicherns der Quelltextdatei bzw. des Modells / Diagramms.\n\
Anmerkung: Das standardm\u00e4\u00dfige Round-Trip-EngineeringNG beim Speichern kann \u00fcber das Men\u00fc deaktiviert und anschlie\u00dfend manuell angesto\u00dfen werden.\n\
Weitere Benutzerinformationen finden sich in der UML Lab Guided Tour sowie in der Benutzerdokumentation.\n\
Hinweis: Die Yatta Solutions bietet zum unentgeltlichen Testen von UML Lab und des Round-Trip-EngineeringNG eine FREE Trial, auf die Anwender ausdr\u00fccklich hingewiesen werden.\n\
\n\
2.5  Mitgelieferte Templates\n\
Die Yatta Solutions liefert mit UML Lab bereits einen Standardsatz Templates mit:\n\
Standard Java\n\
Enthalten ist ein allgemeiner Templatesatz zum Round-Trip-Engineering von Java Quelltext aus einem UML Modell. Dieser erzeugt Quelltext f\u00fcr die folgenden UML Elemente:\n\
Association \n\
Class \n\
Enumeration\n\
Generalization \n\
Interface \n\
InterfaceRealization\n\
Der Templatesatz abstrahiert von technischen Zugriffsmethoden f\u00fcr Implementierungen der UML Attribute und Assoziationen.\n\
JPA\n\
Einen Templatesatz zum Round-Trip-Engineering von Datenmodellen gem\u00e4\u00df dem JPA Standard. Dabei wird von den technischen Zugriffsmethoden sowie den Annotationen des JPA Standards abstrahiert. Ferner werden Querbez\u00fcge zwischen Annotationsattributen und deklarierenden Bezeichnern im Modell aufgel\u00f6st. UML Lab unterst\u00fctzt die folgende, datenbezogene Teilmenge der Annotationen aus der JPA Version 1.0:\n\
AssociationOverride\n\
AssociationOverrides\n\
AttributeOverride\n\
AttributeOverrides\n\
Basic\n\
CascadeType\n\
Column\n\
DiscriminatorColumn\n\
DiscriminatorValue\n\
Embeddable\n\
Embedded\n\
EmbeddedId\n\
Entity\n\
Enumerated\n\
GeneratedValue\n\
Id\n\
IdClass\n\
Inheritance\n\
JoinColumn\n\
JoinColumns\n\
JoinTable\n\
Lob\n\
ManyToMany\n\
ManyToOne\n\
MappedSuperclass\n\
OneToMany\n\
OneToOne\n\
PrimaryKeyJoinColumn\n\
PrimaryKeyJoinColumns\n\
SequenceGenerator\n\
Table\n\
Transient\n\
UniqueConstraint\n\
Version\n\
Legacy Templates\n\
Einen grundlegenden Templatesatz zum Reverse Engineering von Bestandsquelltext (Legacy Code). Legacy Templates dienen als "Fall back", falls \u00fcbrige Templates den vorhandenen Quelltext nicht erzeugen k\u00f6nnen. Dieser Templatesatz abstrahiert nicht von den Details des Quelltextes, sondern bildet ihn weitestgehend 1:1 ab.\n\
\n\
2.6  Integration eigener Erweiterungen\n\
UML Lab kann benutzerdefiniert durch sogenannte Codestile in Form von UML Profilen und Templates erweitert werden. Voraussetzung f\u00fcr die korrekte Funktionsweise von UML Lab ist, dass eigene Templates syntaktisch korrekt bzgl. der \u00dcberpr\u00fcfung im Template-Editor sind. Ansonsten gelten die Beschr\u00e4nkungen des Abschnitts 2.2.1(a) entsprechend.\n\
Benutzerdefinierte Profile umfassen die UML Elemente Stereotype, Stereotype-Attribute, Extension, sowie Assoziationen zu vordefinierten Metaklassen.\n\
\n\
\n\
\n\
3. Systemvoraussetzungen\n\
3.1  Mindestvoraussetzungen\n\
Folgende Mindestvoraussetzungen gelten auf den unterschiedlichen Betriebssystemen, auf denen UML Lab verf\u00fcgbar ist:\n\
\n\
Windows Betriebssysteme\n\
Windows XP / Windows Vista / Windows 7 - jeweils 32-bit oder 64-bit\n\
1 GB freier Arbeitsspeicher\n\
500 MB freier Festplattenspeicher\n\
\n\
MacOS Betriebssysteme\n\
Mac OS X, Leopard 10.5, Java 1.5 64-bit\n\
1 GB freier Arbeitsspeicher\n\
500 MB freier Festplattenspeicher\n\
\n\
Linux Betriebssysteme\n\
Kernel 2.6, Java 1.5 32-bit oder 64-bit, GTK+ 2.4.1\n\
1 GB freier Arbeitsspeicher\n\
500 MB freier Festplattenspeicher\n\
\n\
3.2  Sonstige Systemvoraussetzungen\n\
Dar\u00fcber hinaus k\u00f6nnen sich weitere Voraussetzungen aus der verwendeten Unterst\u00fctzungssoftware, insbesondere durch die mitgelieferte oder verwendete Eclipse IDE ergeben.\n\
Die Kompatibilit\u00e4t von UML Lab mit Software oder Hardware Dritter, welche nicht enumerativ und abschlie\u00dfend als Unterst\u00fctzungssoftware oder in sonstiger Weise aufgelistet ist, kann nicht gew\u00e4hrleistet werden.\n\
\n\
\n\
\n\
4. Glossar\n\
4.1  Codegenerierung oder auch Forward Engineering bezeichnet die Funktion, aus dem Modell in Diagrammform mittels Templates Quelltext zu erzeugen.\n\
4.2  Diagramm(e) bezeichnen eine oder mehrere grafische Diagramme zur Abbildung eines Modells durch verschiedene Syntaxelemente der UML, wie sie in Abschnitt 1.1 n\u00e4her beschrieben sind.\n\
4.3  Die Eclipse IDE bezeichnet die integrierte Entwicklungsumgebung (IDE) der Eclipse Foundation, welche unter der Eclipse Public License (EPL) als Open-Source Software f\u00fcr die Softwareentwicklung zur Verf\u00fcgung steht.\n\
4.4  JPA (Java Persistence API) bezeichnet den Standard JSR 31717 zur datenbankbasierten Speicherung von Daten durch Java Anwendungen.\n\
4.5  Mausgesten bezeichnen die M\u00f6glichkeit, Diagramme durch Drag & Drop-Aktionen zu bearbeiten. N\u00e4here Informationen finden sich in der UML Lab Guided Tour.\n\
4.6  Modell bezeichnet die Architektur einer Software; im Falle von UML Lab besteht das Modell aus Syntaxelementen gem\u00e4\u00df Abschnitt 1.1.\n\
4.7  Quelltext, Quellcode, Code oder Programmcode bezeichnet den f\u00fcr Menschen lesbaren, in einer Programmiersprache geschriebenen Text eines Computerprogrammes.\n\
4.8  Reverse Engineering transformiert Quelltext - oder \u00c4nderungen hieran - in ein Modell. Das Modell kann durch ein oder mehrere Diagramme abgebildet und bearbeitet werden.\n\
4.9  Round-Trip-EngineeringNG bezeichnet den template-basierten Abgleich von Modell und Quelltext mit UML Lab.\n\
4.10  Templates sind Textvorlagen, die herk\u00f6mmlicher Weise zur Codegenerierung - und durch Round-Trip-EngineeringNG und UML Lab auch zum Reverse Engineering - verwendet werden.\n\
4.11  UML bezeichnet die Unified Modeling Language(tm), spezifiziert durch die Object Management Group (OMG). Die Spezifikation der verwendeten UML Version 2.2 kann unter http://www.omg.org/spec/UML/2.2/ abgerufen werden.\n\
4.12  Xpand bezeichnet eine in Eclipse integrierte Templatesprache18. Xpand wird von UML Lab zur Codegenerierung verwendet.\n\
\n\
